In [ ]:
'''
Table: Employee

+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| salary      | int  |
+-------------+------+
id is the primary key (column with unique values) for this table.
Each row of this table contains information about the salary of an employee.
 

Write a solution to find the second highest salary from the Employee table. 
If there is no second highest salary, return null (return None in Pandas).

The result format is in the following example.

 

Example 1:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+
Example 2:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| null                |
+---------------------+
'''

<pre>
# Write your MySQL query statement below

SELECT max(salary) AS SecondHighestSalary
FROM Employee
WHERE salary NOT IN (
		SELECT max(salary)
		FROM Employee
		);
</pre>

## Another solution  OFFSET and LIMIT

<pre>
# Write your MySQL query statement below

SELECT IFNULL((
			SELECT DISTINCT salary
			FROM Employee
			ORDER BY salary DESC limit 1,1    # fisr 1 is OFFSET and second 1 is Limit
			), NULL) AS SecondHighestSalary;
</pre>